app/controllers/homepages_controller.rb

  def index
    @tips = Tip.for_public.all :limit => 5
---
SELECT * FROM `tips` WHERE (state = 1 OR state = 3) ORDER BY created_at DESC LIMIT 5