app/controllers/tips_controller.rb

SELECT * FROM `tips` WHERE (`tips`.`id` = 14)
SELECT * FROM `comments` WHERE (`comments`.tip_id = 14 AND (state != 4)) ORDER BY created_at DESC
SELECT * FROM `favorites` WHERE (`favorites`.`tip_id` = 14 AND `favorites`.`user_id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @tip = Tip.find(params[:id])
    @user = @tip.user
    @comment = Comment.new
    @comments = @tip.comments
    @session_comments = session[:comments] ? Comment.find(session[:comments]) : nil
    @favorite = Favorite.find :first, :conditions => {:user_id => current_user.id, :tip_id => @tip.id} if logged_in?

SELECT * FROM `tips` WHERE (`tips`.`id` = 14)
---
  def edit
    @tip = Tip.find(params[:id])

SELECT * FROM `tips` WHERE (`tips`.`id` = 14)
---
  def update
    @tip = Tip.find(params[:id])